07_pitzDaily3D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001; //Original

//Good1:halfZ 128;
halfZ 384;
minus_halfZ #calc "-1*$halfZ";
NcellZ #calc "2*$halfZ";

vertices
(
    //(-20.6 0 -0.5) //Original
    (-20.6 0 $minus_halfZ)
    (-20.6 25.4 $minus_halfZ)
    (0 -25.4 $minus_halfZ)
    (0 0 $minus_halfZ)
    (0 25.4 $minus_halfZ)
    (206 -25.4 $minus_halfZ)
    (206 0 $minus_halfZ)
    (206 25.4 $minus_halfZ)
    (290 -16.6 $minus_halfZ)
    (290 0 $minus_halfZ)
    (290 16.6 $minus_halfZ)

    //(-20.6 0 0.5) //Original
    (-20.6 0 $halfZ)
    (-20.6 25.4 $halfZ)
    (0 -25.4 $halfZ)
    (0 0 $halfZ)
    (0 25.4 $halfZ)
    (206 -25.4 $halfZ)
    (206 0 $halfZ)
    (206 25.4 $halfZ)
    (290 -16.6 $halfZ)
    (290 0 $halfZ)
    (290 16.6 $halfZ)
);

negY
(
    (2 4 1)
    (1 3 0.3)
);

posY
(
    (1 4 2)
    (2 3 4)
    (2 4 0.25)
);

posYR
(
    (2 1 1)
    (1 1 0.25)
);


blocks
(
    hex (0 3 4 1 11 14 15 12)
    //(18 30 1) //Original
    (18 30 $NcellZ)
    simpleGrading (0.5 $posY 1)

    hex (2 5 6 3 13 16 17 14)
    //(180 27 1) //Original
    (180 27 $NcellZ)
    edgeGrading (4 4 4 4 $negY 1 1 $negY 1 1 1 1)

    hex (3 6 7 4 14 17 18 15)
    //(180 30 1) //Original
    (180 30 $NcellZ)
    edgeGrading (4 4 4 4 $posY $posYR $posYR $posY 1 1 1 1)

    hex (5 8 9 6 16 19 20 17)
    //(25 27 1) //Original
    (25 27 $NcellZ)
    simpleGrading (2.5 1 1)

    hex (6 9 10 7 17 20 21 18)
    //(25 30 1) //Original
    (25 30 $NcellZ)
    simpleGrading (2.5 $posYR 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 12 11)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 20 19)
            (9 10 21 20)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (1 4 15 12)
            (4 7 18 15)
            (7 10 21 18)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 14 11)
            (3 2 13 14)
            (2 5 16 13)
            (5 8 19 16)
        );
    }
    back
    {
        type cyclic;
        neighbourPatch front;
        faces
        (
            (0 3 4 1)
            (2 5 6 3)
            (3 6 7 4)
            (5 8 9 6)
            (6 9 10 7)
        );
    }
    front
    {
        type cyclic;
        neighbourPatch back;
        faces
        (
            (11 14 15 12)
            (13 16 17 14)
            (14 17 18 15)
            (16 19 20 17)
            (17 20 21 18)
        );
    }
);

// ************************************************************************* //
